Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཁྱིམ་བདག་གི་ཆུང་མ་ཚུར་ཁྱོད་ཀྱིས་ཤ་ནའི་རས་སྐྱེ་སར་པར་བྱོས་ལ། གསེར་དང་ས་ལེ་སྦྲམ་གྱིས་ཁོང་སྟེ་ཤིང་རྟའི་ནང་དུ་ཆུག་ལ་ཆུ་བོ་གང་གཱའི་རྒྱུན་ཤུགས་དྲག་ཅིང་གཏིང་ཟབ་པ་གང་ན་ཡོད་པ་དེར་འོར་ཅིག །གཞི་དེ་ལས་ཁྱོད་ཀྱི་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་སྐྱེ་བར་གྱུར་ཏ་རེ།
en: “O householder’s wife, now make new bags with linen, put the gold and fine grains of gold into them, load them on to a carriage, and throw them in a deep, rapid stream in the Ganges. Your sorrow, lamentation, pain, despair, and distress have arisen from those roots.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་མ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་དེ་ལྟ་བུའི་བྱ་བས་ཀྱང་བུ་ཡུལ་འཁོར་སྐྱོང་བཟློག་པར་བྱ་བ་མ་ནུས་སོ་སྙམ་མོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་མས་མནའ་མ་ལ་བཅོལ་བ།
en: Then the venerable Rāṣṭrapāla’s mother thought, “I am not able to turn back my son Rāṣṭrapāla in this way.” The venerable Rāṣṭrapāla's mother then urged her daughter-in-law to help:

source: ཀྱེ་བག་སར་རེ་ཞིག་ཇི་ལྟ་བུའི་མཉེ་བ་རྣམས་ཀྱིས་མཉེས་པ་དང་། ཁྲུས་རྣམས་ཀྱིས་བཀྲུས་པ་དང་། དྲི་རྣམས་ཀྱིས་བྱུགས་པ་དང་། གོས་རྣམས་བསྐོན་པ་དང་། རྒྱན་རྣམས་ཀྱིས་བརྒྱན་པ་དང་། བདུག་པ་རྣམས་ཀྱིས་བདུགས་པ་དང་། ཕྱེ་མ་རྣམས་ཀྱིས་གཏོར་བས། བུ་ཡུལ་འཁོར་སྐྱོང་དེ་སྔོན་ཁྱིམ་པར་གྱུར་པ་ན་དགའ་བ་དང་ཡིད་དུ་འོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་མཉེ་བ་རྣམས་ཀྱིས་མཉེས་པ་དང་། ཁྲུས་རྣམས་ཀྱིས་ཁྲུས་དང་། དྲི་རྣམས་ཀྱིས་བྱུགས་པ་དང་། གོས་རྣམས་བསྐོན་པ་དང་། རྒྱན་རྣམས་ཀྱིས་བརྒྱན་པ་དང་། བདུག་པ་རྣམས་ཀྱིས་བདུགས་པ་དང་། ཕྱེ་མ་རྣམས་ཀྱིས་གཏོར་བ་གྱིས་ལ་བུ་ཡུལ་འཁོར་སྐྱོང་གི་རྐང་པ་གཉིས་ལ་གཏུགས་ལ་འདི་སྐད་ཅེས།
en: “O my daughter, anoint your body with incense, bathe, wear various scents, dress yourself, adorn yourself with adornments, burn various kinds of incense, and scatter incense powder immediately, just as you once pleased and comforted my son Rāṣṭrapāla in that way when he was a layman.

source: གང་གི་སླད་དུ་རྗེའི་སྲས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱོད་པ་ལྷའི་བུ་མོ་ཇི་ལྟ་བུ་ཞིག་ཅེས་ཀྱང་སྨྲོས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་སྔོན་གྱི་ཆུང་མས་ཇི་ལྟ་བུའི་མཉེ་བ་རྣམས་ཀྱིས་མཉེས་པ་དང་། ཁྲུས་རྣམས་ཀྱིས་བཀྲུས་པ་དང་། དྲི་རྣམས་ཀྱིས་བྱུགས་པ་དང་། གོས་རྣམས་བསྐོན་པ་དང་། རྒྱན་རྣམས་ཀྱིས་བརྒྱན་པ་དང་། བདུག་པ་རྣམས་ཀྱིས་བདུགས་པ་དང་། ཕྱེ་མ་རྣམས་ཀྱིས་གཏོར་བས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་སྔོན་ཁྱིམ་པར་གྱུར་པ་ན་དགའ་བ་དང་ཡིད་དུ་འོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་མཉེ་བ་རྣམས་ཀྱིས་མཉེས་པ་དང་། ཁྲུས་རྣམས་ཀྱིས་ཁྲུས་དང་། དྲི་རྣམས་ཀྱིས་བྱུགས་པ་དང་། གོས་རྣམས་བསྐོན་པ་དང་། རྒྱན་རྣམས་ཀྱིས་བརྒྱན་པ་དང་། བདུག་པ་རྣམས་ཀྱིས་བདུགས་པ་དང་། ཕྱེ་མ་རྣམས་ཀྱིས་གཏོར་བ་བྱས་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then throw yourself at my son Rāṣṭrapāla’s feet and say, ‘What are the celestial nymphs like, for the sake of whom you have led the pure life in the presence of the Blessed One?’ ” Then the former wife of the venerable Rāṣṭrapāla did anoint her body with incense, bathed, wore various scents, dressed herself, adorned herself with adornments, burned various kinds of incense, and scattered incense powder just as she had once pleased and comforted the venerable Rāṣṭrapāla in that way when he was a layman.

source: །རྗེའི་སྲས་གང་གི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་ལྷའི་བུ་མོ་དེ་ཇི་ལྟ་བུ་ཞིག་ལགས།
en: She then threw herself at the venerable Rāṣṭrapāla’s feet and said, “What are the celestial nymphs like, for the sake of whom you have led the pure life in the presence of the Blessed One?”

source: སྲིང་མོ་ཁོ་བོ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱོད་པ་ནི་ལྷའི་བུ་མོའི་ཆེད་དུ་མ་ཡིན་ནོ།
en: “O sister, it is not for the sake of celestial nymphs that I have led the pure life in the presence of the Blessed One.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་སྔོན་གྱི་ཆུང་མ་ལ་སྲིང་མོ་ཞེས་ཚིག་ཏུ་སྨྲས་པས་བརྒྱལ་ནས་ས་ལ་འགྱེལ་ཏོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཕ་དང་མ་ལ་སྨྲས་པ། དེ་ཡབ་ཡུམ་གལ་ཏེ་ཁ་ཟས་བཏང་བ་ལགས་ན་ཅི་མི་སྩལ་ཏམ།
en: Then, because the venerable Rāṣṭrapāla addressed his former wife as sister, she fainted and fell to the ground. The venerable Rāṣṭrapāla then said to his parents, “Father, Mother, why do you not give me food if you were going to give it?

source: བཏང་སྙོམས་སུ་བཞག་སྟེ་ཅི་མཐོ་འཚམ་ལགས་སམ།
en: Why leave it and torment me?”

source: བུ་ཡུལ་འཁོར་སྐྱོང་ལོངས་སྤྱོད་ཅིག །ཅེས་དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་དང་མས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དེ།
en: “Our son Rāṣṭrapāla, have it.” Then the parents with their own hands served and satisfied the venerable Rāṣṭrapāla with a pure and fine meal.

source: རྣམ་གྲངས་དུ་མར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ། །ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཟོས་ནས་ལག་པ་བཀྲུས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་འཁོད་དོ།
en: When, with their own hands, they had served and satisfied him in a variety of ways with a pure and fine meal, knowing the venerable Rāṣṭrapāla had finished his meal and washed his hands and his bowl, they took low seats, and sat before the venerable Rāṣṭrapāla in order to hear the Dharma.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The venerable Rāṣṭrapāla then spoke some verses:

source: ལྟོས་ཤིག་ལུས་ནི་ནོར་བུ་དང་། །རྣ་རྒྱན་གྱིས་ནི་བཀྲ་བྱས་པའང་།
en: “Look, even though a body is decorated With jewels and earrings,

source: །ནད་དང་སླུ་བའི་ཆོས་ཅན་ཏེ།
en: It has illness along with its seductive nature

source: །བརྟན་པར་གནས་པ་ཡོད་མ་ཡིན།
en: And never remains stable.

source: །སྐྲ་ཡི་ལན་བུ་བརྒྱད་ལྷས་ཤིང་།
en: “Eight braids of hair

source: །མིག་ནི་མིག་སྨན་གྱིས་བསྐུས་པའང་།
en: And eyes lined with collyrium

source: །བྱིས་པ་རྨོངས་པར་བྱེད་ནུས་ཀྱི།
en: May delude ignorant people,

source: །ཕ་རོལ་ཚོལ་བ་མ་ཡིན་ནོ།
en: But they cannot delude those who seek what is beyond.

source: །དྲི་རྣམས་ཀྱིས་ནི་ལུས་བསྐུས་ལ།
en: “A body anointed with perfumes

source: །རྐང་པ་བཙག་གིས་བྱུགས་པ་ཡང་།
en: And feet smeared with red chalk

source: །མིག་སྨན་གསེར་གྱིས་བཀྲ་བྱས་ཤིང་།
en: “Eyes painted with fresh collyrium

source: །དུལ་བའི་ལུས་ནི་བརྒྱན་པ་ཡང་།
en: And a decorated rotten body

source: །ཕ་རོལ་ཚོལ་བ་མ་ཡིན་ནོ། །རི་དགས་འཆོར་བས་རྙི་བཙུགས་ནས། །རི་དགས་གཟུང་བར་མ་ནུས་ལྟར།
en: But they cannot delude those who seek what is beyond. “A hunter cannot catch a deer that has escaped In spite of a snare laid; in just the same way,

source: །རྔོན་པ་འོ་དོད་འབོད་བཅུག་ལ།
en: Leaving the hunter wailing, you should

source: །ཟོས་ནས་གནས་སུ་འགྲོ་བར་བྱ།
en: Eat and leave for your dwelling place.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཕ་དང་མ་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད།
en: Then the venerable Rāṣṭrapāla, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted his parents.

source: ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་ནས་དེ་ཉིད་ནས་སྟེང་གི་ནམ་མཁའ་ལ་སོང་ངོ་། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བང་མཛོད་སྟུག་པོ་ཅན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བ་རུ་རའི་ཤིང་ཞིག་གི་དྲུང་དུ་ཉིན་པར་གནས་པར་བྱ་བའི་ཕྱིར་འདུག་གོ།
en: Thereupon he flew away across the sky, and the venerable Rāṣṭrapāla went to Sthūlakoṣṭhaka Forest. When he had arrived, he sat under a vibhītaka tree, in order to pass the day there.

source: །དེའི་ཚེ་རྒྱལ་པོ་ཀཽ་རབ་བྱ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་སྙན་པ་ཡང་སྒྲོགས་ཤིང་གནས་ཏེ། ནམ་ཞིག་ན་བདག་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར།
en: At that time, King Kauravya had often been talking about the fame of the venerable Rāṣṭrapāla and said, “I will meet the honorable Rāṣṭrapāla personally sometime.

source: ནམ་ཞིག་ན་གལ་ཏེ་ཞུ་བ་ལུང་བསྟན་པའི་ཕྱིར་སྐབས་ཕྱེ་ན་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་བར་འགྱུར་སྙམ་མོ། །དེ་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱས་ཚལ་སྲུང་བའི་མི་ལ་བསྒོ་བ། ཀྭའི་ནང་རྗེ་ཁྱོད་སོང་ལ་མྱུར་དུ་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་ཚལ་ཕྱག་དར་བྱོས་ཤིག །སང་ང་དེར་སྐྱེད་མོས་ཚལ་གྱི་སར་འགྲོའོ།
en: I will ask him a question sometime, if he would deign to answer.” Then King Kauravya ordered a forest custodian, “My man, go and very quickly clean Sthūlakoṣṭhaka Forest. I will take a stroll there tomorrow.”

source: །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་སྐྱེས་པ་དེས་རྒྱལ་པོ་ཀཽ་རབ་བྱའི་ལྟར་མཉན་ནས་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་ཚལ་ཐམས་ཅད་ཕྱག་དར་བྱེད་པ་ན།
en: “Certainly, Your Majesty,” replied the man to King Kauravya, and he cleaned all of Sthūlakoṣṭhaka Forest.

source: མི་དེས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བ་རུ་རའི་ཤིང་ཞིག་གི་དྲུང་ན་ཉིན་པར་གནས་པར་བྱ་བའི་ཕྱིར་འདུག་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། རྒྱལ་པོ་ཀཽ་རབ་བྱ་གང་གི་སྙན་པ་ཡང་དང་ཡང་དུ་སྒྲོགས་ཤིང་གནས་ཏེ། ནམ་ཞིག་ན་བདག་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར།
en: When the man saw the venerable Rāṣṭrapāla sitting under the vibhītaka tree, passing the day, he thought, “Here is the venerable Rāṣṭrapāla, whose fame King Kauravya has repeatedly talked about and about whom he has said, ‘I will meet the honorable Rāṣṭrapāla personally sometime.

source: ནམ་ཞིག་ན་གལ་ཏེ་ཞུ་བ་ལུང་བསྟན་པའི་ཕྱིར་སྐབས་ཕྱེ་ན་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་བར་འགྱུར་སྙམ་པའི་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་དེ་ནི་འདི་ཡིན་ཏེ། བང་མཛོད་སྟུག་པོ་ཅན་གྱི་འདི་ལྟ་བུ་ཞིག་ཏུ་ཕྱིན་གྱིས།
en: I will ask him a question sometime, if he would deign to answer.’ He has arrived at such-and-such a place near Sthūlakoṣṭhaka.

source: མ་ལ་བདག་གིས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་ལ་སྦྲན་པར་བྱའོ་སྙམ་ནས།
en: I will now inform King Kauravya.”

source: དེ་ནས་སྐྱེས་པ་དེས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the man went to King Kauravya.

source: །ལྷ་གང་གི་སྙན་པ་ཡང་དང་ཡང་དུ་སྒྲོགས་ཤིང་བཞུགས་ལ་ནམ་ཞིག་ན་བདག་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར།
en: When he had arrived, he said to the king, “The venerable Rāṣṭrapāla is here, the one whose fame Your Majesty has repeatedly talked about and about whom you have said, ‘I will meet the honorable Rāṣṭrapāla personally sometime.

source: ནམ་ཞིག་ན་གལ་ཏེ་ཞུ་བ་ལུང་བསྟན་པའི་ཕྱིར་སྐབས་ཕྱེ་ན་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་བར་འགྱུར་སྙམ་པའི་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་དེ་ནི་དེ་ལགས་ཏེ། བང་མཛོད་སྟུག་པོ་ཅན་གྱི་འདི་ལྟ་བུ་ཞིག་ཏུ་མཆིས་ལགས་ཏེ།
en: I will ask him a question sometime, if he would deign to answer.’ He has arrived at such-and-such a place near Sthūlakoṣṭhaka.

source: ལྷ་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་སུ་གསོལ།
en: May Your Majesty know it is the right time.”

source: དེ་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱས་མི་གཞན་ཞིག་ལ་བསྒོ་བ།
en: King Kauravya then ordered another man, “My man, now quickly prepare a beautiful vehicle.

source: ཀྭའི་ནང་རྗེ་ཚུར་བཞོན་པ་བཟང་པོ་མྱུར་དུ་སྡོགས་ཤིག །དེ་ལ་ང་ཞོན་ནས་དེང་ཁོ་ན་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་བལྟ་བའི་ཕྱིར་འགྲོའོ།
en: I will ride in it and go to see the venerable Rāṣṭrapāla today.”

source: །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་མི་དེས་རྒྱལ་པོ་ཀཽ་རབ་བྱའི་ལྟར་མཉན་ནས་བཞོན་པ་བཟང་པོ་མྱུར་དུ་བསྡོགས་ཏེ།
en: “Certainly, Your Majesty,” replied the man to King Kauravya. Then, having quickly prepared the beautiful vehicle, he returned to King Kauravya.

source: རྒྱལ་པོ་ཀཽ་རབ་བྱ་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། རྒྱལ་པོ་ཀཽ་རབ་བྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When he had arrived, he said to King Kauravya, “Your Majesty, the vehicle is ready.

source: །ལྷ་བཅིབས་པ་བཟང་པོ་བསྡོགས་ལགས་ཏེ། ལྷ་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་སུ་གསོལ།
en: May Your Majesty know it is the right time.”

source: དེ་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་བཞོན་པ་བཟང་པོ་ལ་ཞོན་ནས་བང་མཛོད་སྟུག་པོ་ཅན་ནས་བྱུང་སྟེ། ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་སོང་ནས།
en: King Kauravya then rode in the beautiful vehicle, left Sthūlakoṣṭhaka, and went to see and serve the venerable Rāṣṭrapāla.

source: དེ་ཇི་ཙམ་བཞོན་པའི་བར་དུ་བཞོན་པས་སོང་སྟེ། བཞོན་པ་ལས་བབས་ནས་རྐང་པ་ཁོ་ནས་ཀུན་དགའ་ར་བར་ཞུགས་སོ།
en: Having gone as far as he could go by vehicle, he alighted from the vehicle and entered the park on foot.

source: །ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་རྒྱང་རིང་པོ་ཁོ་ན་ནས་འོངས་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ། རྒྱལ་པོ་ཆེན་པོ་བྱོན་པ་ལེགས་སོ་ཚུར་སྤྱོན།
en: When the venerable Rāṣṭrapāla saw King Kauravya coming from a distance, he said, “Welcome, Great King.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཉིད་ཀྱི་ཡུལ་ལགས་པས་བཞེད་ན་བདག་ཀྱང་སྟན་ལ་གཡར་དྲོངས་ཤིག །ཀྱེ་ཡུལ་འཁོར་སྐྱོང་བདག་གི་ཡུལ་ལགས་མོད་ཀྱི།
en: Now, Great King, since this is your country, please invite me to a seat if you so like.”

source: འོན་ཀྱང་ཡུལ་འཁོར་སྐྱོང་གིས་བདག་སྟན་ལ་གཡར་དྲང་བར་འཚལ་ལོ།
en: “O Rāṣṭrapāla, my country it is, but I ask you, Rāṣṭrapāla, to invite me to a seat.”

source: །རྒྱལ་པོ་ཆེན་པོ་གདན་མཆིས་ཀྱིས་གལ་ཏེ་བཞེད་ན་བཞུགས་ཤིག །དེ་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་། མགུ་བར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: “Then, Great King, here is a seat for you. Please sit down, if you so like.” Face to face with the venerable Rāṣṭrapāla, King Kauravya then made plenty of pleasant and joyful conversation, and sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་གལ་ཏེ་རིགས་དམན་པའམ། ལོངས་སྤྱོད་རྣམས་ཡོངས་སུ་ཟད་པའམ། གཏུགས་པར་གྱུར་ན་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བ་ཡོད་ན།
en: When he had sat down to one side, King Kauravya said to the venerable Rāṣṭrapāla, “O honorable Rāṣṭrapāla, if one belongs to a lowly family, has run through his entire possessions, or has become old, he might go forth from his home into homelessness with true faith, having shaved off his hair and beard and donned saffron robes.

source: བདག་ཅག་རིགས་ནི་ཀཽ་རབ་བྱ་ཡིན་ལ། ལོངས་སྤྱོད་ནི་རྒྱ་ཆེ་བ་ཡིན་གྱིས། འདི་ལྟར་ཁོ་བོས་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ལ་ལོངས་སྤྱོད་ཀྱི་སྐལ་བ་དག་ལས་བགོ་བཤའ་བྱས།
en: Since we belong to the Kauravya family and our possessions are abundant, I have thus allotted a portion of our possessions to the honorable Rāṣṭrapāla.

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ཚུར་ཁྱོད་འདུག་ལ་འདོད་པ་དག་ལ་ཡང་ཡོངས་སུ་སྤྱོད་ཅིག །སྦྱིན་པ་དག་ཐོང་ཤིག །བསོད་ནམས་དག་གྱིས་ཤིག །རྒྱལ་པོ་ཆེན་པོ་ཆ་མ་ལགས་པའི་མགྲོན་དུ་འབོད་པས་བདག་མགྲོན་དུ་འབོད་ཀྱི་འཚམ་པས་ནི་མ་ལགས་སོ།
en: O honorable Rāṣṭrapāla, stay here now, enjoy the objects of desire, give donations, and make merit.” “The Great King has invited me in an inappropriate way, not in an appropriate way.

source: །ཁྱོད་ལྟ་བུས་བདག་འདྲ་བའི་སྐྱེས་བུ་མཁས་པ་འདི་ལྟ་བུའི་མགྲོན་དུ་འབོད་པས་མགྲོན་དུ་ཡང་མ་འབོད་ཅིག །བདག་གིས་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་དང་འཚམ་པའི་མགྲོན་དུ་འབོད་པས་མགྲོན་དུ་འབོད་པ་ཇི་ལྟ་བུ་ཞིག་ལགས།
en: One like you must not invite a learned man like me in such a way.” “How should I invite you, honorable Rāṣṭrapāla, if in an appropriate way?”

source: རྒྱལ་པོ་ཆེན་པོ་ཚུར་སྤྱོན། ཁྱོད་ཀྱིས་འདི་སྐད་ཅེས་ཀྱེ་ཡུལ་འཁོར་སྐྱོང་ཁོ་བོའི་ཡུལ་འབྱོར་ཅིང་གནོད་པ་མེད་པ། སྡོ་བ་མེད་ཅིང་འཚེ་བ་མེད་ལ་སློང་བ་པོའི་བསོད་སྙོམས་རྙེད་སླ་བ་ཡིན་གྱིས།
en: “Great King, if you were now to say, ‘O Rāṣṭrapāla, my country is rich and free from harm, calamity, and danger, and there it is easy to obtain almsfood;

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་བང་མཛོད་སྟུག་པོ་ཅན་འདིར་གནོས་ཤིག་དང་། བདག་གིས་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ཆོས་བཞིན་གྱིས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བ་བྱའོ་ཞེས་བགྱི་བ་ལགས་ན།
en: O honorable Rāṣṭrapāla, stay in this Sthūlakoṣṭhaka, and I will protect, shelter, and guard you in accordance with the Dharma,’ O Great King, that I would wish.

source: རྒྱལ་པོ་ཆེན་པོ་སེམས་མངོན་པར་དད་པ་གང་ལ་གང་ལགས་པ་དེ་ཙམ་གྱིས་བགྱིས་ལགས་ཏེ་འཚལ་ལོ།
en: Such is said only by one with a faithful mind.”

source: །གཞན་ཡང་གལ་ཏེ་ཞུས་པ་ལུང་བསྟན་པའི་ཕྱིར་སྐབས་ཕྱེ་ན་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ལ་བདག་ཞུ་ལགས་སོ།
en: “If you would deign to answer my questions, I would ask some questions of the venerable Rāṣṭrapāla.”

source: །རྒྱལ་པོ་ཆེན་པོ་གསུངས་ཤིག །ཐོས་ནས་ཁྱོད་ལ་རིག་པར་བགྱིའོ།
en: “O Great King, ask. I will explain after listening.”

source: །ཀྱེ་ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་འདི་དག་ནི་ཡོངས་སུ་ཉམས་པ་ལགས་ཏེ།
en: “O Rāṣṭrapāla, there are four kinds of decay;

source: དེ་དག་གིས་ཡོངས་སུ་ཉམས་པའི་རིགས་ཀྱི་བུ་དག་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: because they have decayed through these, sons of noble families will go forth from their homes into homelessness with true faith, having shaved off their hair and beards and donned saffron robes.

source: །བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the four?

source: རྒ་བས་ཡོངས་སུ་ཉམས་པ་དང་། ནད་ཀྱིས་ཡོངས་སུ་ཉམས་པ་དང་། ཉེ་དུས་ཡོངས་སུ་ཉམས་པ་དང་། ལོངས་སྤྱོད་ཀྱིས་ཡོངས་སུ་ཉམས་པའོ།
en: Decay through old age, decay through illness, decay in terms of relatives, and decay in terms of possessions.

source: །ཀྱེ་ཡུལ་འཁོར་སྐྱོང་རྒ་བས་ཡོངས་སུ་ཉམས་པ་གང་ཞེ་ན།
en: “O Rāṣṭrapāla, what is decay through old age?

source: འདི་ལ་རིགས་ཀྱི་བུ་རྒས་འཁོགས་གཏུགས་པར་གྱུར་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ད་ནི་བདག་རྒས་འཁོགས་གཏུགས་པས་བདག་གིས་རེ་ཞིག་འདོད་པ་དག་བདོག་ཀྱང་ལོངས་སྤྱད་པར་སླ་བ་མ་ཡིན་ན་མི་བདོག་ན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Here a son of a noble family, having become old and decrepit, thinks, ‘Now, since I am old and decrepit, I cannot easily enjoy even the objects of desire that I possess right now, let alone what I do not possess.

source: མ་ལ་བདག་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ལ་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་ངོ་སྙམ་ནས། དེ་རྒ་བའི་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་སྟེ།
en: Now I will go forth from my home into homelessness with true faith, having shaved off my hair and beard and donned saffron robes.’ Because he has decayed through old age, he will go forth from his home into homelessness with true faith, having shaved off his hair and beard and donned saffron robes.

source: འདི་ནི་རྒ་བའི་ཡོངས་སུ་ཉམས་པ་ཞེས་བྱའོ།
en: This is said to be decay through old age.

source: །ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་རྒ་བའི་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པ་མ་ཡིན་ན་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Though you, honorable Rāṣṭrapāla, had not decayed through old age, you went forth from your home into homelessness with true faith, having shaved off your hair and beard and donned saffron robes. Why?

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ནི་གཞོན་ནུ་ཐོར་བུ་ལང་ཚོ་ལ་བབ་པ། སྐྲ་གནག་པ།
en: You, honorable Rāṣṭrapāla, are young, junior, youthful, with black hair, in the prime of youth.

source: ན་ཚོད་དར་ལ་བབ་པ་དང་ལྡན་པ་ཡིན་ཏེ། གང་གི་ཚེ་རྩེད་མོ་དང་། དགའ་བ་དང་། མགུ་བ་དང་། ཆ་བ་དང་། བརྒྱན་པའི་གནས་ལ་བརྩོན་པ་དང་ལྡན་པས་གནས་པར་བྱ་བ་དེའི་ཚེ་ཉེ་དུ་རྣམས་མཆི་མས་བརྣངས་ཤིང་ངུ་བཞིན་དང་བཅས་པས་མ་རངས་བཞིན་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན།
en: While you should be involved in play, pleasure, fun, adornment, and decoration, you instead went forth from your home into homelessness with true faith, having shaved off your hair and beard and donned saffron robes, though your relatives were choked with tears, crying, and not happy.

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་གིས་ཅི་ཞིག་ཤེས་མཐོང་ཐོས་རྟོགས་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་།
en: What did you, honorable Rāṣṭrapāla, know, see, hear, and understand so that you went forth in that way?

source: དེ་ལ་ནི་ཁོ་བོས་རངས་པ་མ་ཡིན་ཏེ་མི་བཟོད་དོ།
en: I am not pleased with this; I cannot bear this.

source: །ཀྱེ་ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ནད་ཀྱིས་ཡོངས་སུ་ཉམས་པ་གང་ཞེ་ན།
en: “O honorable Rāṣṭrapāla, what is decay through illness?

source: འདི་ལ་རིགས་ཀྱི་བུ་ན་བ་སྡུག་བསྔལ་བ་ནད་ཚབས་ཆེ་བར་གྱུར་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་ན་བ་སྡུག་བསྔལ་བ་ནད་ཚབས་ཆེ་བས་བདག་གིས་རེ་ཞིག་འདོད་པ་དག་བདོག་ཀྱང་ལོངས་སྤྱད་པར་སླ་བ་མ་ཡིན་ན་མི་བདོག་ན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Here a son of a noble family has become seriously ill, afflicted with a painful illness, and thinks, ‘Since I am seriously ill, afflicted with a painful illness, I cannot easily enjoy even the objects of desire that I possess right now, let alone what I do not possess.

source: མ་ལ་བདག་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ནས་ཞེས་བྱ་བ་ནས་རབ་ཏུ་འབྱུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནད་ཀྱིས་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་ཞེས་བྱ་བ་ནས་རབ་ཏུ་འབྱུང་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Now I will go forth . . . , having shaved off my hair and beard and donned saffron robes.’ Because he has decayed through illness, he will go forth . . . , having shaved off his hair and beard and donned saffron robes.

source: །འདི་ནི་ནད་ཀྱིས་ཡོངས་སུ་ཉམས་པ་ཞེས་བྱའོ།
en: This is said to be decay through illness.

source: །ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ནི་ནད་ཀྱིས་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པ་མ་ཡིན་ནོ། །སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཞེས་བྱ་བ་ནས་རབ་ཏུ་བྱུང་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Though you, honorable Rāṣṭrapāla, had not decayed through illness, you went forth . . . with true faith, having shaved off your hair and beard and donned saffron robes. Why?

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་གནོད་པ་མེད་ཅིང་ནད་མེད་པའི་རང་བཞིན་ཅན་དང་། རན་པར་འཇུག་པའི་དྲོད་དང་ལྡན་པ་སྟེ།
en: You, honorable Rāṣṭrapāla, are free from harm, free from illness, and your temperature is in a good state, neither too cold nor too hot but healthy and free from harm.

source: ཧ་ཅང་བསིལ་བ་མ་ཡིན་པ་དང་། ཧ་ཅང་ཚ་བ་མ་ཡིན་པ་དང་། ཁམས་སྙོམས་པས་གནོད་པ་མེད་པ་དང་ལྡན་པས་ཁྱོད་ཀྱིས་ཟོས་པ་དང་། འཐུངས་པ་དང་། འཆོས་པ་དང་། མྱངས་པ་རྣམས་ལེགས་པར་བདེ་བར་འཇུ་བར་འགྱུར་ན།
en: You will safely digest foods, drink—whatever you eat, and whatever you taste.

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་དེ་ལ་ཅི་ཞིག་ཤེས་མཐོང་ཞེས་བྱ་བ་ནས་རབ་ཏུ་འབྱུང་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: What did you, honorable Rāṣṭrapāla, know, see . . . so that you went forth . . .?

source: །དེ་ལ་ནི་ཁོ་བོ་རངས་པ་མ་ཡིན་ཏེ་མི་བཟོད་དོ།
en: I am not pleased with this; I cannot bear this.

source: །ཀྱེ་ཡུལ་འཁོར་སྐྱོང་ཉེ་དུས་ཡོངས་སུ་ཉམས་པ་གང་ཞེ་ན།
en: “O Rāṣṭrapāla, what is decay in terms of relatives?

source: འདི་ལ་རིགས་ཀྱི་བུའི་ཉེ་དུ་རྣམས་རབས་ཆད་ཉེ་དུ་རྣམས་ཁ་དག་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་ཉེ་དུ་རྣམས་རབས་ཆད་ཉེ་དུ་རྣམས་ཁ་དག་པས་མ་ལ་བདག་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཞེས་བྱ་བ་ནས་རབ་ཏུ་འབྱུང་བར་བྱའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ཉེ་དུའི་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་ཞེས་བྱ་བ་ནས་རབ་ཏུ་འབྱུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Here a son of a noble family, after his relatives have died and gone, thinks, ‘Since my relatives have died and gone, now I will go forth . . . , having shaved off my hair and beard . . . .’ Because he has decayed in terms of relatives, he will go forth . . . , having shaved off his hair and beard . . . .

source: །འདི་ནི་ཉེ་དུས་ཡོངས་སུ་ཉམས་པ་ཞེས་བྱའོ།
en: This is said to be decay through relatives.

source: །ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་ནི་ཉེ་དུས་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པ་མ་ཡིན་ན། སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Though you, honorable Rāṣṭrapāla, had not decayed in terms of relatives, you went forth . . . with true faith, having shaved off your hair and beard and donned saffron robes. Why?

source: ཡུལ་འཁོར་སྐྱོང་གི་ཉེ་དུ་ནི་ཀཽ་རབ་བྱའི་རིགས་ནས་བཟུང་སྟེ་བརྒྱུད་པ་བང་མཛོད་སྟུག་པོ་ཅན་འདི་ཉིད་ན་རྒྱས་པར་ཡོད་ན།
en: Rāṣṭrapāla, your relatives originate from the Kauravya family, and they are prospering in this Sthūlakoṣṭhaka.

source: ཤེས་ལྡན་ཡུལ་འཁོར་སྐྱོང་གིས་ཅི་ཞིག་ཤེས་མཐོང་ཞེས་བྱ་བ་ནས་རབ་ཏུ་བྱུང་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: What did you, honorable Rāṣṭrapāla, know, see . . . so that you went forth . . .?

source: །དེ་ལ་ནི་ཁོ་བོས་རངས་པ་མ་ཡིན་ཏེ་མི་བཟོད་དོ།
en: I am not pleased with this; I cannot bear this.

source: །ཀྱེ་ཡུལ་འཁོར་སྐྱོང་ལོངས་སྤྱོད་ཀྱིས་ཡོངས་སུ་ཉམས་པ་གང་ཞེ་ན།
en: “O Rāṣṭrapāla, what is decay in terms of possessions?
